cases/convection/0/U
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.2                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version 2.0;
	class volVectorField;
	object U;
	format ascii;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];
internalField uniform (100 0 0);

boundaryField
{
    patch0_half0
    {
        type empty;
    }
    patch0_half1
    {
        type empty;
    }
    patch1_half0
    {
        type zeroGradient;
    }
    patch1_half1
    {
        type zeroGradient;
    }
    patch2_half0
    {
        type zeroGradient;
    }
    patch2_half1
    {
        type zeroGradient;
    }
}
